<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"11cd23d152344c61a28c575192cd3527bc520b0ebe2023ad3a66157894fec146","plan_job_ref":"Job Pull Request Checks #4760 at https://github.com/GSA-TTS/FAC/actions/runs/14710819772","plan_out_hash":"aa0142876d0929137de044dca42d94f8758aaa42864816f9777bfb4c2b98b42f","plan_hash":"4a6f73a7d4722543c8c56c3df5ff0ba6f40fa589d8e5c5edbeb549c12381adac","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 9 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
+       buildpacks                  = (known after apply)
!~      created_at                  = "2025-04-21T18:49:18Z" -> (known after apply)
!~      docker_image                = "ghcr.io/gsa-tts/fac/postgrest@sha256:b5c12243cbbe709021b4c5cc4936a1a0cc8bc828dfe4ed958ce65d756b127760" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:80cb7dbcf58efcc5d65ff0a62ef012a8cf3b9959b751d2a548132796468a9123"
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "postgrest"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-dev-postgrest.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      stack                       = null -> (known after apply)
!~      updated_at                  = "2025-04-21T18:49:24Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.dev.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "99884884-59ae-8864-786d-a5e33d1b1455"

-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
        }
-       policy {
-           destination_app = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "d7fcdc7a-fd97-4e31-89ae-b823883b5992"
        }

#        (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "30fc72e9-9a5e-c40d-140c-98bc1b576989"

-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
        }
-       policy {
-           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
        }
+       policy {
+           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "caa8e542-9d7e-438d-a17c-3af19b05eaa6"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
        id = "1c06d5ba-733a-e0a1-8eb6-d577a1347e2b"

-       policy {
-           destination_app = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "a0669f56-c5a5-4c35-85bf-5b6201478ad5"
        }

#        (1 unchanged block hidden)
    }

  # module.dev.cloudfoundry_route.postgrest will be updated in-place
!~  resource "cloudfoundry_route" "postgrest" {
!~      destinations = [
-           {
-               app_id           = "c1ba2481-d372-4e4e-9bb8-1f53a86f065d" -> null
-               app_process_type = "web" -> null
-               id               = "70ac0252-a838-4716-b4f4-54307902ffcc" -> null
-               port             = 3000 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "fd2a07e7-c167-4d36-a9bc-ccac564ae2d5"
!~      updated_at   = "2025-04-21T18:49:24Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3dea1e8936dc4df006e12224bd1eea11b8384d496d4deef7aa58b8ad4ef856e4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-21T18:45:39Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-25T13:50:07Z" -> (known after apply)
        }
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:22:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:3dea1e8936dc4df006e12224bd1eea11b8384d496d4deef7aa58b8ad4ef856e4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:631e0ec843a85e2ea8d97eaae565b488a06db44e24ead5155af06573957c9023"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-dev-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-dev-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-04-21T18:55:40Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.dev.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "ea09b23c-eebc-4383-9f4d-29152236ad87" -> null
-               app_process_type = "web" -> null
-               id               = "3253c01b-5425-4c19-822d-c60fe6ee7ed4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "877bbc1f-e036-4a96-b7a3-70cff8c35c3c"
!~      updated_at   = "2025-04-21T18:47:15Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.dev.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "6eab89ac-271f-4193-893f-cfa1f590f3d9" -> null
-               app_process_type = "web" -> null
-               id               = "c835e4b1-d935-431f-915a-f9510fa15dce" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "c9f3cfde-125b-4aa2-93f3-5eaff644b5c0"
!~      updated_at   = "2025-04-23T13:51:56Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 9 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4760](https://github.com/GSA-TTS/FAC/actions/runs/14710819772)